nxp-mcuxpresso/mcux-soc-svd/KW47B42Z96/KW47B42Z96_cm33_core1.xml
        <register>
          <name>BTU_RIF_BRF_FSYN_ADDR</name>
          <description>RIF BRF FSYN Address</description>
          <addressOffset>0xC24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x6</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Fsyn_Addr</name>
              <description>Radio Register Start Address for Fsyn data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BRF_TXPWRCTL_ADDR</name>
          <description>RIF BRF Tx Power Control Address</description>
          <addressOffset>0xC26</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Tx_Pwr_Ctrl_Addr</name>
              <description>Radio Register Address for Tx Power Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BTC_DBUS_RSSI</name>
          <description>BTC RIF dBus RSSI</description>
          <addressOffset>0xC28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8002</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_RSSI_Delay</name>
              <description>Delay from RSSI trigger to start of RSSI read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_RSSI_Enable</name>
              <description>Enable Automatic Reading of RSSI on the dBus</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable automatic reading of RSSI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable automatic reading of RSSI</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_TX_FSYN</name>
          <description>RIF Tx dBus Fsyn</description>
          <addressOffset>0xC2A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8034</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Tx_Fsyn_Delay</name>
              <description>Tx dBus Fsyn Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Tx_Fsyn_Wr_Enable</name>
              <description>Tx dBus Fsyn Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable automatic sending of fsync info</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable automatic sending of fsync info</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_RX_FSYN</name>
          <description>RIF Rx dBus Fsyn</description>
          <addressOffset>0xC2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8042</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Rx_Fsyn_Delay</name>
              <description>Rx dBus Hop Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBus_Rx_Fsyn_Wr_Enable</name>
              <description>Rx dBus Fsyn Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable automatic sending of fsync info</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable automatic sending of fsync info</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_RX_PKT_LEN</name>
          <description>RIF dBus Rx Packet Length</description>
          <addressOffset>0xC2E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xC000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Rx_Cte_Len_Enable</name>
              <description>dBus Rx CTE Length Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable automatic dbus sending Rx packet CTE length</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable automatic dbus sending Rx packet CTE length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBus_Rx_Pkt_Len_Enable</name>
              <description>dBus Rx Packet Length Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable automatic dbus sending Rx packet payload length</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable automatic dbus sending Rx packet payload length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_PULSE_RX_DELAY</name>
          <description>RIF BLE Pulse Rx Delay</description>
          <addressOffset>0xC30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x135</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_Pulse_Rx_Delay</name>
              <description>BLE Pulse Rx Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_BLE_PULSE_TX_DELAY</name>
          <description>RIF BLE Pulse Tx Delay</description>
          <addressOffset>0xC32</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xD9</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ble_Pulse_Tx_Delay</name>
              <description>BLE Pulse Tx Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_DBUS_RX_MODE_TYPE</name>
          <description>RIF dBus Rx Mode Type</description>
          <addressOffset>0xC34</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DBus_Rx_Mode_Type_Enable</name>
              <description>dBus Rx Mode Type Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>disable automatic dbus sending Rx mode type</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>enable automatic dbus sending Rx mode type</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_MODE_TYPE_TX_DELAY</name>
          <description>RIF Mode Type Tx Delay</description>
          <addressOffset>0xC36</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x277</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Mode_Type_Tx_Delay</name>
              <description>Mode Type Tx Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_MODE_TYPE_RX_DELAY</name>
          <description>RIF Mode Type Rx Delay</description>
          <addressOffset>0xC38</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x82</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Mode_Type_Rx_Delay</name>
              <description>Mode Type Rx Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_PKTCTL_OE_DELAY</name>
          <description>RIF Packet Control OE Delay</description>
          <addressOffset>0xC3A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Pkt_Ctl_Oe_Delay_ModeType</name>
              <description>Packet Control OE Delay Mode Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Pkt_Ctl_Oe_Delay_PPulse</name>
              <description>Packet Control OE Delay P Pulse</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Pkt_Ctl_Oe_Delay_HdrStart</name>
              <description>Packet Control OE Delay Header Start</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RF_Bypass</name>
              <description>Radio Bypass Mode Used for Baseband to Baseband Testing</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_TXSYNC_GUARD_DELAY</name>
          <description>RIF Tx Sync Guard Delay</description>
          <addressOffset>0xC3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xD</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Tx_Sync_Guard_Delay</name>
              <description>Tx Sync Guard Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_RXSYNC_TIMER</name>
          <description>RIF Rx Sync Timer</description>
          <addressOffset>0xC3E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x4603</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>Rx_Sync_Timer_Delay</name>
              <description>Rx Sync Timer Delay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Rx_Sync_Timer_Timeout</name>
              <description>Rx Sync Timer Timeout</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_SWDBUS_CTL</name>
          <description>RIF Software dBus Control</description>
          <addressOffset>0xC40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_addr</name>
              <description>dBus register address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_finished</name>
              <description>Poll status of dBus access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>busy</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>finished</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sw_dbus_size_bytes</name>
              <description>number of bytes to read or write</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>1 byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>2 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V2</name>
                  <description>3 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V3</name>
                  <description>4 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V4</name>
                  <description>5 byteS</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V5</name>
                  <description>6 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V6</name>
                  <description>7 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V7</name>
                  <description>8 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>sw_dbus_start</name>
              <description>Start a new dBus access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>sw_dbus_rd</name>
              <description>Read/write control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V0</name>
                  <description>write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1</name>
                  <description>read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_SWDBUS_EVENT</name>
          <description>RIF Software dBus Event</description>
          <addressOffset>0xC42</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_count</name>
              <description>Count to trigger software dBus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_rst</name>
              <description>software dBus reset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_dbus_event</name>
              <description>Event to trigger software dBus access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWDBUS_EVENT_NONPKT</name>
                  <description>SWDBUS_EVENT_NONPKT (when there is no packet activity)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDBUS_EVENT_PKT_ASAP</name>
                  <description>SWDBUS_EVENT_PKT_ASAP (as soon as possible during packet activity)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDBUS_EVENT_PKT_START</name>
                  <description>SWDBUS_EVENT_PKT_START (when rif_startCount equals sw_dbus_count)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDBUS_EVENT_PKT_END</name>
                  <description>SWDBUS_EVENT_PKT_END (when rif_endCount equals sw_dbus_count)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_SWDBUS_DATA_1_0</name>
          <description>RIF Software dBus Data_1_0</description>
          <addressOffset>0xC44</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata0</name>
              <description>Software Access Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_dbus_wdata1</name>
              <description>Software Access Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_SWDBUS_DATA_3_2</name>
          <description>RIF Software dBus Data_3_2</description>
          <addressOffset>0xC46</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata2</name>
              <description>Software Access Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>sw_dbus_wdata3</name>
              <description>Software Access Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTU_RIF_SWDBUS_DATA_5_4</name>
          <description>RIF Software dBus Data_5_4</description>
          <addressOffset>0xC48</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>sw_dbus_wdata4</name>
              <description>Software Access Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dbus_wdata5</name>
              <description>Software Access Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
