nxp-mcuxpresso/mcux-soc-svd/KW47B42Z96/KW47B42Z96_cm33_core1.xml
                  <name>DISABLED</name>
                  <description>FILTERFAIL Interrupt is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>FILTERFAIL Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCA_IRQ_EN</name>
              <description>CCA_IRQ Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CCA Interrupt is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>CCA Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MS_IRQ_EN</name>
              <description>MS_IRQ Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>MS Interrupt is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>MS Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENT_TMR</name>
          <description>EVENT TIMER</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EVENT_TMR</name>
              <description>Event Timer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T1_CMP</name>
          <description>T1 COMPARE</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T1_CMP</name>
              <description>Timer1 (T1) Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T2_CMP</name>
          <description>T2 COMPARE</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T2_CMP</name>
              <description>Timer2 (T2) Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMESTAMP</name>
          <description>TIMESTAMP</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>TIMESTAMP</name>
              <description>Received Packet Timestamp</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XCVR_CTRL</name>
          <description>TRANSCEIVER CONTROL</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7FF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQCMD</name>
              <description>Sequence Commands, also named as &quot;XCVSEQ(Transceiver Sequence)&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Same as command ABORT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_START_NOW</name>
                  <description>TX Start Now</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_START_T1</name>
                  <description>TX Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_START_T2</name>
                  <description>TX Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX_CANCEL</name>
                  <description>TX Cancel -- Cancels pending TX events but do not abort a TX-in-progress</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_START_NOW</name>
                  <description>RX Start Now</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_START_T1</name>
                  <description>RX Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_START_T2</name>
                  <description>RX Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_STOP_T1</name>
                  <description>RX Stop @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_STOP_T2</name>
                  <description>RX Stop @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_CANCEL</name>
                  <description>RX Cancel -- Cancels pending RX events but do not abort a RX-in-progress</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <description>Abort All - Cancels all pending events and abort any sequence-in-progress</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TR_START_NOW</name>
                  <description>TR Start Now</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TR_START_T1</name>
                  <description>TR Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TR_START_T2</name>
                  <description>TR Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TR_START_CANCEL</name>
                  <description>TR Cancel -- Cancels pending TR events but do not abort a TR-in-progress</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_START_NOW</name>
                  <description>CCA Start Now</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_START_T1</name>
                  <description>CCA Start @ T1 Timer Compare Match (EVENT_TMR = T1_CMP)</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_START_T2</name>
                  <description>CCA Start @ T2 Timer Compare Match (EVENT_TMR = T2_CMP)</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA_START_CANCEL</name>
                  <description>CCA Cancel -- Cancels pending CCA events but do not abort a CCA-in-progress</description>
                  <value>0x13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LENGTH_EXT</name>
              <description>Extracted Length Field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMDDEC_CS</name>
              <description>Command Decode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XCVR_BUSY</name>
              <description>Transceiver Busy</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XCVR_BUSY_0</name>
                  <description>IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XCVR_BUSY_1</name>
                  <description>BUSY</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XCVR_STS</name>
          <description>TRANSCEIVER STATUS</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LQI</name>
              <description>Link Quality Indicator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LQI_VALID</name>
              <description>LQI Valid Indicator</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>LQI is not yet valid for RX packet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>LQI is valid for RX packet.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSSI</name>
              <description>RSSI Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XCVR_CFG</name>
          <description>TRANSCEIVER CONFIGURATION</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_WHITEN_DIS</name>
              <description>TX Whitening Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DEWHITEN_DIS</name>
              <description>RX De-Whitening Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_CRC_EN</name>
              <description>Software CRC Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_POSTPONE_ON_AA</name>
              <description>Postpone Stop Command Timeout On Access Address Match Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_POSTPONE_ON_AA_0</name>
                  <description>STOP Abort will occur on RX_STOP_T1 or RX_STOP_T1 Event Timer match, regardless of NTW_ADR_MCH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_POSTPONE_ON_AA_1</name>
                  <description>STOP Abort will be deferred on RX_STOP_T1 or RX_STOP_T1 Event Timer match, if NTW_ADR_MCH is asserted; otherwise the RX_STOP Abort will occur immediately</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREAMBLE_SZ</name>
              <description>Preamble Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GEN_PREAMBLE</name>
              <description>Preamble pattern</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_SEL</name>
              <description>Preamble Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PREAMBLE_AUTO</name>
                  <description>The controller hardware selects the preamble pattern based on the first transmitted bit of Network Address, such that the last bit of preamble is the opposite polarity from the first bit of Network Address, forcing a bit transition at this boundary.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GEN_PREAMBLE</name>
                  <description>Preamble is programmed by register GEN_PREAMBLE[7:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREAMBLE_01</name>
                  <description>Preamble is 0b01</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREAMBLE_10</name>
                  <description>Preamble is 0b10</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>T1_CMP_EN</name>
              <description>Timer1 (T1) Compare Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T2_CMP_EN</name>
              <description>Timer2 (T2) Compare Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL_NUM0</name>
          <description>CHANNEL NUMBER 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHANNEL_NUM0</name>
              <description>Channel Number for PAN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TX_POWER</name>
          <description>TRANSMIT POWER</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_POWER</name>
              <description>Transmit Power</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTW_ADR_CTRL</name>
          <description>NETWORK ADDRESS CONTROL</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTW_ADR_EN</name>
              <description>Network Address Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NTW_ADR_EN_1</name>
                  <description>Enable Network Address 0 for correlation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_EN_2</name>
                  <description>Enable Network Address 1 for correlation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_EN_4</name>
                  <description>Enable Network Address 2 for correlation</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_EN_8</name>
                  <description>Enable Network Address 3 for correlation</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTW_ADR_MCH</name>
              <description>Network Address Match</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NTW_ADR_MCH_1</name>
                  <description>Network Address 0 has matched</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_MCH_2</name>
                  <description>Network Address 1 has matched</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_MCH_4</name>
                  <description>Network Address 2 has matched</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_MCH_8</name>
                  <description>Network Address 3 has matched</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTW_ADR_SZ</name>
              <description>Network Address Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NTW_ADR_SZ_0</name>
                  <description>Network Address 0/1/2/3 requires a 8-bit correlation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_SZ_1</name>
                  <description>Network Address 0/1/2/3 requires a 16-bit correlation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_SZ_2</name>
                  <description>Network Address 0/1/2/3 requires a 24-bit correlation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NTW_ADR_SZ_3</name>
                  <description>Network Address 0/1/2/3 requires a 32-bit correlation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NTW_ADR_THR</name>
              <description>Network Address Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NTW_ADR_0</name>
          <description>NETWORK ADDRESS 0</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x55555555</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NTW_ADR_0</name>
              <description>Network Address 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
