nxp-mcuxpresso/mcux-soc-svd/KW47B42Z96/KW47B42Z96_cm33_core1.xml
        <register>
          <name>SAM_MATCH</name>
          <description>SOURCE ADDRESS MANAGEMENT MATCH</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFF7FFF7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAP0_MATCH</name>
              <description>Index in the SAP0 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP0_ADDR_PRESENT</name>
              <description>A Checksum Match is Present in the SAP0 Partition of the SAM Table</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_MATCH</name>
              <description>Index in the SAA0 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_ADDR_ABSENT</name>
              <description>A Checksum Match is Absent in the SAA0 Partition of the SAM Table</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP1_MATCH</name>
              <description>Index in the SAP1 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP1_ADDR_PRESENT</name>
              <description>A Checksum Match is Present in the SAP1 Partition of the SAM Table</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_MATCH</name>
              <description>Index in the SAA1 Partition of the SAM Table corresponding to the first checksum match</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_ADDR_ABSENT</name>
              <description>A Checksum Match is Absent in the SAP1 Partition of the SAM Table</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAM_FREE_IDX</name>
          <description>SAM FREE INDEX</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80808080</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAP0_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAP0 partition</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA0_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAA0 partition</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAP1_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAP1 partition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAA1_1ST_FREE_IDX</name>
              <description>First non-enabled (invalid) index in the SAA1 partition</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC1</name>
          <description>MISCELLANEOUS(1)</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRC_ADDR_CHECKSUM</name>
              <description>Hardware-computed received source address checksum</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SW_ABORTED</name>
              <description>Autosequence has terminated due to a Software abort.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_ABORTED</name>
              <description>Autosequence has terminated due to an PLL unlock event.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_ABORTED</name>
              <description>Autosequence has terminated due to a Wake-On-Radio command</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARB_GRANT_DEASSERTION_ABORTED</name>
              <description>Autosequence has terminated due to an arb_grant de-assertion event</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_TX_WU_OVRD</name>
              <description>FAST_TX_WU override</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_TX_WU_OVRD_0</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it when TX in RT or (CCA+TX)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_TX_WU_OVRD_1</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it at every TX. User should insure channel is not changed since last sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_RX_WU_OVRD</name>
              <description>FAST_RX_WU override</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FAST_RX_WU_OVRD_0</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it when RX in TR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAST_RX_WU_OVRD_1</name>
                  <description>If TSM enables Fast Warmup Capability, LL will request it at every RX. User should insure channel is not changed since last sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI</name>
              <description>Poll Indication</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PI_0</name>
                  <description>the received packet was not a data request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PI_1</name>
                  <description>the received packet was a data request, regardless of whether a Source Address table match occurred, or whether Source Address Management is enabled or not</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_FRM_PEND</name>
              <description>RX Frame Pending</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_STS</name>
          <description>SEQUENCE STATUS</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TX_START_T1_PEND</name>
              <description>TX T1 Start Pending Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_START_T2_PEND</name>
              <description>TX T2 Start Pending Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_WARMUP</name>
              <description>TX Warmup Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_PROGRESS</name>
              <description>TX in Progress Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_IN_WARMDN</name>
              <description>TX Warm-down Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_START_T1_PEND</name>
              <description>RX T1 Start Pending Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_START_T2_PEND</name>
              <description>RX T2 Start Pending Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_STOP_T1_PEND</name>
              <description>RX T1 Stop Pending Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_STOP_T2_PEND</name>
              <description>RX T2 Start Pending Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_WARMUP</name>
              <description>RX Warmup Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_SEARCH</name>
              <description>RX Search Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_PROGRESS</name>
              <description>RX in Progress Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_IN_WARMDN</name>
              <description>RX Warm-down Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_START_T1_PEND</name>
              <description>TR T1 Start Pending Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TR_START_T2_PEND</name>
              <description>TR T2 Start Pending Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA_START_T1_PEND</name>
              <description>CCA T1 Start Pending Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCA_START_T2_PEND</name>
              <description>CCA T2 Start Pending Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEQ_T_STATUS</name>
              <description>Status of the just-completed or ongoing Sequence T or Sequence TR</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHR_MISC</name>
          <description>PHR MISCELLANEOUS</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SUNFSK_MS</name>
              <description>Mode Switch Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUNFSK_MSP</name>
              <description>Mode Switch Parameter Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUNFSK_FEC</name>
              <description>New Mode FEC Bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SUNFSK_NM</name>
              <description>New Mode Bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHR_FAIL_IGNORE</name>
              <description>Ignore PHR Fail</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_CTRL</name>
          <description>GTM CONTROL</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_IN_RX</name>
              <description>Enable GTM Receive Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>GTM receive mode is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>GTM receive mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GTM_IN_TX</name>
              <description>Enable GTM Transmit Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>GTM transmit mode is not enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>GTM transmit mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_BAD_CNT</name>
          <description>GTM BAD PACKET COUNTER</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_BAD_PKT_COUNT</name>
              <description>GTM Bad Packet Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_GOOD_CNT</name>
          <description>GTM GOOD PACKET COUNTER</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_GOOD_PKT_COUNT</name>
              <description>GTM Good Packet Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GTM_PKT_CNT</name>
          <description>GTM PACKET COUNTER</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GTM_PKT_COUNT</name>
              <description>GTM Packet Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_CTRL</name>
          <description>COEXISTENCE CONTROL</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COEX_EN</name>
              <description>Coexistence Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_EN_0</name>
                  <description>Coexistence function is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_EN_1</name>
                  <description>Coexistence function is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_REQ_DELAY_EN</name>
              <description>Coexistence Request Delay Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_REQ_DELAY_EN_0</name>
                  <description>arb_request is not delayed during R sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_REQ_DELAY_EN_1</name>
                  <description>arb_request is delayed until preamble or Access Address is detected during R sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_REQ_ON_PD</name>
              <description>Coexistence Request on Preamble detected</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COEX_REQ_ON_PD_0</name>
                  <description>arb_request is delayed until Access Address is detected during R sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COEX_REQ_ON_PD_1</name>
                  <description>arb_request is delayed until preamble is detected during R sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COEX_TIMEOUT</name>
              <description>Coexistence timeout value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
