nxp-mcuxpresso/mcux-soc-svd/KW47B42Z96/KW47B42Z96_cm33_core1.xml
        <register>
          <name>LOCK_DETECT</name>
          <description>PLL Lock Detect Control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x606800</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CT_FAIL</name>
              <description>Real time status of Coarse Tune Fail signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTFF</name>
              <description>CTUNE Failure Flag, held until cleared</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FT_FAIL</name>
              <description>Real time status of Frequency Target Failure</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FTFF</name>
              <description>Frequency Target Failure Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CTUNE_LDF_LEV</name>
              <description>CTUNE Lock Detect Fail Level</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTF_RX_THRSH</name>
              <description>RX Frequency Target Fail Threshold</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTF_TX_THRSH</name>
              <description>TX Frequency Target Fail Threshold</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCAL_HOLD_EN</name>
              <description>Frequency Counter Hold Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCAL_HOLD_EN_0</name>
                  <description>The frequency counter is turned off after CTUNE (RX Mode) or HPM CAL (TX Mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCAL_HOLD_EN_1</name>
                  <description>The frequency counter is held on after CTUNE (RX Mode) or HPM CAL (TX Mode) for an optional lock detect sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTW_TXRX</name>
              <description>TX and RX Frequency Target Window time select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FTW_TXRX_0</name>
                  <description>FTW_TX = 4us ; FTW_RX = 4us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTW_TXRX_1</name>
                  <description>FTW_TX = 4us ; FTW_RX = 8us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTW_TXRX_2</name>
                  <description>FTW_TX = 8us ; FTW_RX = 4us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTW_TXRX_3</name>
                  <description>FTW_TX = 8us ; FTW_RX = 8us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTW_TXRX_4</name>
                  <description>FTW_TX = 16us ; FTW_RX = 16us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTW_TXRX_5</name>
                  <description>FTW_TX = 16us ; FTW_RX = 32us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTW_TXRX_6</name>
                  <description>FTW_TX = 32us ; FTW_RX = 16us</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FTW_TXRX_7</name>
                  <description>FTW_TX = 32us ; FTW_RX = 32us</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQ_COUNT_GO</name>
              <description>Start the Frequency Meter</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_COUNT_FINISHED</name>
              <description>Frequency Meter has finished the Count Time</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FREQ_COUNT_TIME</name>
              <description>Frequency Meter Count Time</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREQ_COUNT_TIME_0</name>
                  <description>800 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_COUNT_TIME_1</name>
                  <description>25 us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_COUNT_TIME_2</name>
                  <description>50 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ_COUNT_TIME_3</name>
                  <description>100 us</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HPM_CTRL</name>
          <description>PLL High Port Modulator Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x840000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_SDM_IN_MANUAL</name>
              <description>Manual High Port SDM Fractional value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_DYNAMIC_SEL</name>
              <description>HPM dynamic calibration factor source selection for channel sounding</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CLK_CONFIG</name>
              <description>HPM Clock Config</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPFF</name>
              <description>HPM SDM Invalid Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>HPM_SDM_OUT_INVERT</name>
              <description>Invert HPM SDM Output</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_SDM_IN_DISABLE</name>
              <description>Disable HPM SDM Input</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_LFSR_SIZE</name>
              <description>HPM LFSR Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_LFSR_SIZE_0</name>
                  <description>LFSR 9, tap mask 100010000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_LFSR_SIZE_1</name>
                  <description>LFSR 10, tap mask 1001000000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_LFSR_SIZE_2</name>
                  <description>LFSR 11, tap mask 11101000000</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_LFSR_SIZE_3</name>
                  <description>LFSR 13, tap mask 1101100000000</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_LFSR_SIZE_4</name>
                  <description>LFSR 15, tap mask 111010000000000</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_LFSR_SIZE_5</name>
                  <description>LFSR 17, tap mask 11110000000000000</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_HPM_CAL_EN</name>
              <description>Receive HPM Calibration Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_DTH_SCL</name>
              <description>HPM Dither Scale</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_DYNAMIC_RX_PKT_TABLE</name>
              <description>If HPM_DYNAMIC_SEL is set to 1, RX packet will be applied following HPM calibration factor:</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_DYNAMIC_RX_PKT_TABLE_0</name>
                  <description>constant value from HPM_CAL_FACTOR_MANUAL register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_DYNAMIC_RX_PKT_TABLE_1</name>
                  <description>table value from packet RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_DYNAMIC_RX_TONE_TABLE</name>
              <description>If HPM_DYNAMIC_SEL is set to 1, RX tone will be applied following HPM calibration factor:</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_DYNAMIC_RX_TONE_TABLE_0</name>
                  <description>constant value from HPM_CAL_FACTOR_MANUAL register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_DYNAMIC_RX_TONE_TABLE_1</name>
                  <description>table value from packet RAM</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_DTH_EN</name>
              <description>Dither Enable for HPM LFSR</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_SCALE</name>
              <description>High Port Modulation Scale</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_SCALE_0</name>
                  <description>No Scaling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_SCALE_1</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_SCALE_2</name>
                  <description>Multiply by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_SCALE_3</name>
                  <description>Multiply by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_SCALE_4</name>
                  <description>Divide by 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_SCALE_5</name>
                  <description>Multiply by 8</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_SCALE_6</name>
                  <description>Divide by 8</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_SCALE_7</name>
                  <description>N/A</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_INTEGER_INVERT</name>
              <description>Invert High Port Modulation Integer</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL_INVERT</name>
              <description>Invert High Port Modulator Calibration</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL_TIME</name>
              <description>High Port Modulation Calibration Time</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_CAL_TIME_0</name>
                  <description>25 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_TIME_1</name>
                  <description>50 us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_TIME_2</name>
                  <description>100 us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_TIME_3</name>
                  <description>N/A</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_MOD_IN_INVERT</name>
              <description>Invert High Port Modulation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPMCAL_CTRL</name>
          <description>PLL High Port Calibration Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2221</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_CAL_FACTOR</name>
              <description>High Port Modulation Calibration Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HPM_CAL_ARRAY_SIZE</name>
              <description>High Port Modulation Calibration Array Size</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_CAL_ARRAY_SIZE_0</name>
                  <description>128</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_ARRAY_SIZE_1</name>
                  <description>256</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPM_CAL_COUNT_SCALE</name>
              <description>HPM_CAL_COUNT_SCALE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_CAL_DISABLE</name>
              <description>Disable HPM Manual Calibration</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL_FACTOR_MANUAL</name>
              <description>Manual HPM Calibration Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL_SKIP</name>
              <description>HPM_CAL_SKIP</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_CAL_BUMPED</name>
              <description>HPM_CAL_BUMPED</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HPM_CAL_BUMPED_0</name>
                  <description>No calibration boost</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_BUMPED_1</name>
                  <description>x2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_BUMPED_2</name>
                  <description>x4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HPM_CAL_BUMPED_3</name>
                  <description>x8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HPM_CAL1</name>
          <description>PLL High Port Calibration Result 1</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x44300000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_COUNT_1</name>
              <description>High Port Modulation Counter Value 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPM_CAL2</name>
          <description>PLL High Port Calibration Result 2</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_COUNT_2</name>
              <description>High Port Modulation Counter Value 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPM_SDM_RES</name>
          <description>PLL High Port Sigma Delta Results</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPM_NUM_SELECTED</name>
              <description>High Port Modulator SDM Numerator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HPM_DENOM</name>
              <description>High Port Modulator SDM Denominator</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPM_COUNT_ADJUST</name>
              <description>HPM_COUNT_ADJUST</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
